API_KEY = "dzw7np03ExpODqYQjNbI59jE7z8HSXYp"
# API_KEY = "P7s9CFWcuuCDyJbbFwukHKyRiPGGdmUl"
FOOTER = "版权所有 © 2025 朱希涵 保留所有权利"
MAP = "地图"
METRO = "地铁"
VIEW_MARKERS = "地点一览"
ADD_COORDINATES = "添加坐标"
ABOUT_SCHOOL = "关于河海"
LNG = "经度"
LAT = "纬度"
TAG = "标签"
ADDRESS = "地址"
NUM = "序号"
DELETE = "删除"
DIVISIONS = "行政区划"
CHOOSE_CITY = "选择城市"
CITIES = [
   "北京",
   "上海",
   "广州",
   "深圳",
   "南京",
   "重庆",
   "成都"
]
HINT_START = "请输入起点"
HINT_END = "请输入终点"
BTN_CHECK = "查询"
ABOUT_HOHAI = """
   河海大学是一所拥有110年办学历史，以水利为特色，工科为主，多学科协调发展的教育部直属全国重点大学，是国家“双一流”建设、“211工程”重点建设、“985工程优势学科创新平台”建设以及经国家批准设立研究生院的高校。百余年来，学校在治水兴邦的奋斗历程中发展壮大，被誉为“水利高层次创新创业人才培养的摇篮和水利科技创新的重要基地”。学校在南京市、常州市设有西康路校区、江宁校区和常州校区。

   河海大学源于1915年由近代著名爱国实业家、教育家张謇创办的河海工程专门学校，是中国第一所培养水利人才的高等学府，开创了中国水利高等教育的先河。张闻天、沈泽民等无产阶级革命家曾在河海求学，并从这里走上革命道路。1924年与东南大学工科合并成立河海工科大学，1927年并入第四中山大学土木工程系（后历经江苏大学工学院土木系、中央大学工学院水利组、中央大学水利系、南京大学水利系等多次更名）。1952年，南京大学水利系与交通大学、同济大学、浙江大学等高校的水利系科以及华东水利专科学校组建华东水利学院，钱正英为首任院长。1960年，学校被中共中央认定为全国重点高校。1985年恢复传统校名“河海大学”，邓小平同志题写了校名。

   学校设有水文水资源学院、水利水电学院、港口海岸与近海工程学院、土木与交通学院、环境学院、电气与动力工程学院、计算机与软件学院、力学与工程科学学院、地球科学与工程学院、农业科学与工程学院、水土保持学院、机电工程学院、信息科学与工程学院、人工智能与自动化学院、新能源学院、材料科学与工程学院、海洋学院、地理与遥感学院、数学学院、商学院、经济与金融学院、公共管理学院、应急管理与安全工程学院、法学院、马克思主义学院、外国语学院、体育系、大禹学院、未来技术学院、卓越工程师学院、河海里尔学院等专业院系。现有各类学历教育学生55292名，其中研究生19171名，普通本科生22024名，留学生1359名。现有教职工3579名，专任教师2229名，具有高级职称1476名。现有院士5名（其中外籍院士3名），国家级高层次人才123人次，省部级各类人才培养计划700余人次；全国模范教师1名，全国优秀教师2名，国家级教学名师7名；国家级、省部级教学、创新团队49支。

   学校是国家首批授权授予学士、硕士和博士学位的高校之一。水利工程、环境科学与工程2个学科入围一流学科建设名单。水资源工程蝉联软科世界一流学科排名全球第一。工程学、环境/生态学、计算机科学、材料科学、地球科学、农业科学、化学、社会科学总论、数学、植物与动物科学10个学科进入ESI世界排名前1%，其中工程学、环境/生态学进入世界排名前1‰。学校共有20个一级学科博士学位授权点，4个博士专业学位授权点，42个一级学科硕士学位授权点，20个硕士专业学位授权点，覆盖了哲学、经济学、法学、教育学、文学、理学、工学、农学、管理学等9个学科门类。共有72个本科专业。

   学校坚持立德树人根本任务，弘扬务实重行的教育传统，培养了30余万名毕业生。以“宽基础，强实践，重创新”为导向，大力推进一流本科建设，拥有国家级一流本科专业建设点37个，入选国家级一流本科课程42门，入选首批国家课程思政教学研究示范中心1个，获国家级教学成果奖15项。研究生教育以培养造就德才兼备的高层次创新人才为目标，持续深化综合改革，形成了规模稳步扩大、布局结构更加优化、体制机制更加健全、资源配置更加合理的研究生教育新格局，在江苏省研究生教育工作综合评价中连续三年获评A等。近年来，学校毕业生去向落实率始终保持95%以上。

   学校坚持“四个面向”，深化科研体制机制改革，打造有组织科研范式，系统建设高能级创新平台，主动服务国家重大战略、行业需求及区域经济社会发展。学校拥有水灾害防御全国重点实验室和水资源高效利用与工程安全国家工程研究中心，共建国家风力发电技术创新中心，14个省部级重点实验室（含国际合作联合实验室），1个省部共建协同创新中心和4个江苏省高校协同创新中心。成立长江保护与绿色发展研究院，构建长江大保护与长江经济带高质量发展科学中心、技术高地和人才基地；成立黄河、淮河、珠江、太湖等流域研究中心，建设调水工程研究院等机构，为淮河及太湖治理、南水北调工程建设、粮食安全保障等提供平台和智力支持；成立产业技术研究院，推进科技成果转化落地；与苏州市共建河海大学苏州高等研究院，在精准服务区域发展中彰显特色。以保障国家水安全、服务高质量发展为己任，在水旱灾害防御、国家水网重大工程建设、河湖生态环境治理、智慧水利建设、新能源开发等重点领域，紧密结合三峡工程、南水北调工程、西南水电开发、流域综合治理等重大工程建设管理，承担了一大批国家层面重点、重大研究计划和科研项目，实现一系列引领性、原创性和标志性成果产出。2010年以来，获国家级科技成果奖32项，部省级科技成果奖1000余项。

   学校大力推进教育对外开放，广泛开展国际合作与交流，是国家首批授权可授予外国留学生博士、硕士、学士学位的高校，已为100余个国家和地区培养了数千名各类人才，与40余个国家（地区）的130余所大学、科研院所和大型企业建立了合作关系。近年来，学校主动融入国家“一带一路”倡议，服务“走出去”战略，为“一带一路”沿线国家及我国海外工程企业提供科技支持和人才支撑。持续完善国内合作发展体系，健全校友网络，创新性成立校友企业家联谊会、团学骨干校友联谊会，形成以地区校友分会为支撑，学院、行业校友分会等相互依托的校友会组织，打造学校-校友发展共同体。不断深化与地方政府全面合作，聚焦重点领域重大工程，广泛拓展合作资源，深度对接行业产业，推动校地融合发展，提升学校社会影响力。

   锐意改革再出发，砥砺奋进新征程。学校将坚持以习近平新时代中国特色社会主义思想为指导，深入贯彻落实党的二十大精神，全面贯彻党的教育方针，秉承“艰苦朴素、实事求是、严格要求、勇于探索”的校训精神，坚持和加强党对学校工作的全面领导，推进教育、科技、人才“三位一体”协同融合发展，高质量开创世界一流特色研究型大学建设新局面，为以中国式现代化全面推进强国建设、民族复兴伟业，作出新的更大贡献！
"""
