INSERT INTO locations (lng, lat, address, tag) VALUES
(118.792331, 31.920764, '江苏省南京市江宁区佛城西路8号', '河海大学江宁校区'),
(118.792412, 31.91785, '江苏省南京市江宁区佛城西路20号', '南门'),
(118.793848, 31.91872, '江苏省南京市江宁区佛城西路8号', '博学楼'),
(118.793995, 31.918598, '江苏省南京市江宁区佛城西路8号', '商学院'),
(118.794058, 31.91938, '江苏省南京市江宁区佛城西路8号', '勤学楼'),
(118.794071, 31.919135, '江苏省南京市江宁区佛城西路8号', '德州仪器嵌入式联合实验室'),
(118.793362, 31.919131, '江苏省南京市江宁区佛城西路8号', '卫生所'),
(118.79404, 31.919211, '江苏省南京市江宁区佛城西路8号', '电工电子实验中心'),
(118.79346, 31.919472, '江苏省南京市江宁区佛城西路8号', '能源与电气学院'),
(118.794296, 31.919744, '江苏省南京市江宁区佛城西路8号', '廉池'),
(118.794534, 31.919537, '江苏省南京市江宁区佛城西路8号', '计算机与信息学院'),
(118.793061, 31.91871, '江苏省南京市江宁区佛城西路8号', '五岳独尊石像'),

(118.792426,31.919406, '江苏省南京市江宁区佛城西路8号', '逸夫图书馆'),
(118.791245,31.91936, '江苏省南京市江宁区佛城西路8号', '励学楼'),
(118.791164,31.91823, '江苏省南京市江宁区佛城西路8号', '大禹学院'),
(118.789583,31.917625, '江苏省南京市江宁区佛城西路8号', '南操场');
